CorrectionCodeIgniterFlorent/correction/framework-4.4.3/app/Models/PersonnelModel.php

    public function getPersonnels($idPersonnel = false)
    {
        if ($idPersonnel === false) {
            return $this->findAll();
---
SELECT *
FROM `personnel`