CorrectionCodeIgniterFlorent/correction/framework-4.4.3/app/Models/ProductModel.php

SELECT *
FROM `product`
---
    public function getProducts($idProduct = false)
    {
        if ($idProduct === false) {
            return $this->findAll();