CorrectionCodeIgniterFlorent/correction/framework-4.4.3/app/Models/UserModel.php

SELECT *
FROM `user`
---
    public function getUsers($iduser = false)
    {
        if ($iduser === false) {
            return $this->findAll();